artillery_load_test.yml
config:
  # This is a test server run by team Artillery
  # It's designed to be highly scalable
  target: http://grafana-1777174802.us-east-1.elb.amazonaws.com
  phases:
    - duration: 400
      arrivalRate: 1
      rampTo: 2
      name: Warm up phase
    - duration: 60
      arrivalRate: 5
      rampTo: 10
      name: Ramp up load
    - duration: 30
      arrivalRate: 10
      rampTo: 30
      name: Spike phase
  # Load & configure a couple of useful plugins
  # https://docs.art/reference/extensions
  plugins:
    ensure: {}
    apdex: {}
    metrics-by-endpoint: {}
  apdex:
    threshold: 100
  ensure:
      thresholds:
        - http.response_time.p99: 100
        - http.response_time.p95: 75
scenarios:
  - flow:
      - loop:
        - get:
            url: "/dashboards"
        - get:
            url: "/d/f8742187-f440-4ee8-96cc-bad5af8edef1/air-quality-monitoring?orgId=1"
        count: 100